Revit 2024 API
MassSurfaceDataSource Enumeration
 Indicates whether values for the properties of the MassSurfaceData are synchronized with the EnergyDataSettings of the document or instead, serve as overrides of those settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum MassSurfaceDataSource
Visual Basic
Public Enumeration MassSurfaceDataSource
Visual C++
public enum class MassSurfaceDataSource
Members
Member name | Description
Invalid |  This value indicates that the parameter has not been properly set.
EnergyData |  Synchronize with the EnergyDataSettings.
Surface |  Override the EnergyDataSettings values for the surface.
See Also
Autodesk.Revit.DB.Analysis Namespace